document.addEventListener("DOMContentLoaded", function () {
  const submitButton = document.getElementById("submit");
  const resultSection = document.getElementById("result");

  submitButton.addEventListener("click", function () {
    const responses = document.querySelectorAll('input[type="radio"]:checked');
    const counts = { D: 0, I: 0, S: 0, C: 0 };

    responses.forEach((response) => {
      counts[response.value]++;
    });

    let maxType = "D"; // Default to 'D'
    let maxValue = counts.D;

    for (const type in counts) {
      if (counts[type] > maxValue) {
        maxType = type;
        maxValue = counts[type];
      }
    }

    let imageUrl = "";
    let topic = "";
    let text = "";

    if (maxType === "D") {
      imageUrl = "img/dominance.jpeg";
      topic = "Dominance";
      text =
        "បើអ្នកជ្រើសរើសចម្លើយទី1 ច្រើនបំផុត អ្នកគឺជា ខ្ទីង អ្នកដែលមានលក្ខណៈដូច ខ្ទីង គឺជាអ្នកដែលយកឈ្នះ ចូលចិត្តការប្រកួតប្រជែង ត្រង់ទៅត្រង់មក និងមានគោលដៅច្បាស់លាស់។ ក្រៅពីនេះជាបុគ្គលដែលអាចប្រឈមមុខនឹងបញ្ហាផ្សេងៗបានយ៉ាងឆាប់រហ័ស ដូចជាខ្ទីងដែលបោលឆ្ពោះទៅកាន់គោលដៅអញ្ចឹង។ ការនៅជាមូយមនុស្សប្រភេទនេះត្រូវយល់ពីពួកគាត់អោយបានច្បាស់ និយាយត្រង់មិនបង្វែងដាន ផ្តោតសំខាន់លើលទ្ធផលនិងគោលដៅ។-ចំណុចខ្លាំង មានភាពជាអ្នកដឹកនាំ មានទំនួលខុសត្រូវ មានការមើលថែក្រុម ពុះពារមិនចុះចាញ់រាល់ឧបសគ្គដោយងាយៗ ចូលចិត្តស្វែងរកឱកាសថ្មីៗជានិច្ច មានកម្លាំងចិត្ត កម្លាំងកាយខ្លាំង ជាអ្នកចុះដៃធ្វើអោយឃើញលទ្ធផល។-ចំណុចដែលត្រូវអភិវឌ្ឍពេលខ្លះតាំងខ្លួនជាធំ មិនចូលចិត្តត្រូវបញ្ជាឬត្រូវគ្រប់គ្រង និងការដែលផ្តោតសំខាន់លើលទ្ធផលធ្វើអោយទំនាក់ទំនងការងារអាចខុសឆ្គងខ្លះ ព្រមទាំងមិនយកចិត្តទុកដាក់រឿងតូចៗ។";
    } else if (maxType === "I") {
      imageUrl = "img/influence.jpeg";
      topic = "Influence";
      text =
        "បើអ្នកជ្រើសរើសចម្លើយទី2 ច្រើនបំផុត អ្នកគឺជា ឥន្ទ្រី ជាបុគ្គលដែលចូលសង្គម ពូកែនិយាយ ចេរចា ចូលចិត្តសេរីភាពមិនចូលចិត្តធ្វើអ្វីដដែលៗ មានការគិតទូលំទូលាយ មានការស្រមើស្រមៃខ្ពស់ ជាអ្នកគិតអ្នកស្រមៃ ចូលចិត្តធ្វើអ្វីៗច្រើនយ៉ាងខណៈពេលតែមូយ។ ការនៅជាមូយមនុស្សប្រភេទនេះ កុំនិយាយបង្រៀនពួកគេច្រើន គ្រាន់តែប្រាប់ពីគោលដៅសំខាន់ៗ អោយគាត់ទៅរកវិធីចាត់ការខ្លូនឯង និងរកសកម្មភាពថ្មឹៗអោយពួកគេ។-ចំណុចខ្លាំងជាមនុស្សដែលមានគំនិតច្នៃប្រឌិត អាចគិតវិធីដោះស្រាយបញ្ហាថ្មីៗ ដែលអ្នកផ្សេងគិតមិនដល់ ព្រោះចូលចិត្តរៀនសូត្រអ្វីដែលថ្មីៗ ទើបធ្វើអោយមានចំណេះដឹងទូលំទូលាយ និងជាអ្នកសម្លឹងមើលអនាគត។-ចំណុចដែលត្រូវអភិវឌ្ឍដោយការរវល់តែគិតច្រើន ទើបធ្វើអោយុមិនបានចុះដៃធ្វើអោយលេចចេញជារូបរាង ឬធ្វើអ្វីច្រើនយ៉ាងព្រមគ្នារហូតមិនអាចផ្តោតសំខាន់លើលម្អិតដែលសមគួរ ហើយពេលខ្លះធ្វើអោយមិនបានរៀបចំលំដាប់ភាពសំខាន់នៃការងារ។";
    } else if (maxType === "S") {
      imageUrl = "img/steadiness.jpeg";
      topic = "Steadiness";
      text =
        "បើអ្នកជ្រើសរើសចម្លើយទី3 ច្រើនបំផុត អ្នកគឺជា កណ្តុរ ជាមនុស្សដែលមានក្តីមេត្តា មានទឹកចិត្ត ចេះជូយអ្នកដទៃ ជាមនុស្សទន់ជ្រាយ ផ្តល់ភាពសំខាន់ចំពោះអារម្មណ៍ច្រើនជាងអ្វីផ្សេងៗ។ ជាមនុស្សសកម្ម រហ័សរហួន​ ពូកែលេង មិនមានទំនាស់ជាមូយអ្នកដទៃ។ ជាមនុស្សមិនបើកចំហរ មានបែបបទ សុភាពរាបសារ។ ការរស់នៅជាមូយមនុស្សប្រភេទនេះត្រូវ​យកចិត្តទុកដាក់ចំពោះអារម្មណ៍ជាពិសេស ផ្តល់ភាពសំខាន់ និងផ្តល់កម្លាំងចិត្ត ពួកគេចូលចិត្តអ្វីដែលមានលំដាប់ជំហានច្បាស់លាស់។-ចំណុចខ្លាំងធ្វើការជាក្រុមបានល្អ អាចបង្កើនភាពរឹងមាំអោយក្រុមបាន ជាបុគ្គលដែលទទួលស្តាប់និងយកចិត្តទុកដាក់អ្នកដទៃ ដឹងថាត្រូវធ្វើយ៉ាងណាដើម្បីកុំអោយកើតទំនាស់ ជាអ្នកសម្របសម្រួលដ៏ល្អ-ចំណុចដែលត្រូវអភិវឌ្ឍដោយការដែលជាមនុស្សយល់ចិត្តអ្នកដទៃ តែងតែត្រូវបានអ្នកដទៃយកប្រៀប ពេលខ្លះក៏ក្រែងចិត្តអ្នកដទៃខ្លាំងពេក ខ្លាចនិងមិនជឿជាក់លើខ្លួនឯង មិនចូលចិត្តជាអ្នកដឹកនាំ។";
    } else if (maxType === "C") {
      imageUrl = "img/conscientiousness.jpeg";
      topic = "Conscientiousness";
      text =
        "បើអ្នកជ្រើសរើសចម្លើយទី4 ច្រើនបំផុត អ្នកគឺជា ខ្លាឃ្មុំ ជាមនុស្សដែលចូលចិត្តភាពនឹងនរខ្ពស់ មិនចូលចិត្តការផ្លាស់ប្តូរ យឺតប៉ុន្តែច្បាស់លាស់ ផ្តោតលើគុណភាពនិងដំណើរការដែលត្រឹមត្រូវជាប្រព័ន្ធ ចូលចិត្តស្វែងរកទិន្នន័យលម្អិត មានវិន័យខ្ពស់ ចូលចិត្តនៅម្នាក់ឯងមានពិភពលោកផ្ទាល់ខ្លួនខ្ពស់។​ មនុស្សប្រភេទតែងតែមិនចូលចិត្តបញ្ចេញអារម្មណ៍ និងមិនចូលចិត្តភាពវឹកវរ ការទំនាក់ទំនងជាមូយមនុស្សប្រភេទនេះត្រូវមានគោលការណ៍និងទ្រឹស្តីច្បាស់លាស់។-ចំណុចខ្លាំងជាមនុស្សដែលមានការប្រុងប្រយ័ត្នខ្ពស់ មិនសូវមានកំហុសឆ្គងចំពោះអ្វីដែលលម្អិត ដឹងពិតដឹងច្បាស់ មានទំនួលខុសត្រូវខ្ពស់។ ប្រើហេតុផលនិងទិន្នន័យក្នុងការសម្រេចចិត្តដើម្បីអោយកើតលទ្ធផលជាក់លាក់ ផ្តោតលើការបង្ការបញ្ហាជាជាងដោះស្រាយបញ្ហាដែលបានកើតឡើង។-ចំណុចដែលត្រូវអភិវឌ្ឍដោយការដែលមានភាពអភិរក្សនិយម ទើបធ្វើអោយសម្របខ្លួនបានយឺត។ បើជឿលើគោលការណ៍របស់ខ្លួនហើយ នឹងមិនសូវទទួលស្តាប់អ្នកដទៃ មិនសូវមានគំនិតថ្មីៗ។";
    }

    resultSection.innerHTML = `<img src="${imageUrl}" alt="Result Image"><p>${topic}</p><p>${text}</p>`;
  });
});
